# #Задание 1
# employee_list = ["Jonh Snow", "Piter Pen", "Drakula", "IvanIV", "Moana", "Juilet"]
# for e in range (0, len(employee_list)):
#     print (employee_list[1]+ ',' + employee_list[-2])
#
# #Задание 2
# def dev_by_three (numbers):
#     return 'Да' if (numbers % 3 == 0) else "Нет"
# num = int(input("Введите число:"))
# result = dev_by_three(num)
# print(f'Делится ли на три {num}? - {result}')

# #Задание 3
# import math
# def min_boxes(items):
#     return math.ceil(items/5)
# num_items = int(input('Введите количество предметов: '))
# print(f'Минимальное количество коробок:{min_boxes(num_items)}')

#Задание 4
def check_divisibility(n):
